---
kind: type
id: T:Autodesk.Revit.DB.EndCapCondition
source: html/2ee406b8-42de-d7cd-e628-cf7c0c32dec0.htm
---
# Autodesk.Revit.DB.EndCapCondition

Used by CompoundStructure to describe which shell layers participate in end wrapping.

## Syntax (C#)
```csharp
public enum EndCapCondition
```